import { faCaretRight, faChevronRight, faClock, faTimes, faUser } from "@fortawesome/free-solid-svg-icons";
import { FontAwesomeIcon } from "@fortawesome/react-fontawesome";
import React, { Fragment } from "react";
import { Col, Container, Row } from "react-bootstrap";
import { Link } from "react-router-dom";
import demo1 from '../../asset/image/demo1.jpg'
import ContentLayoutThree from "../ContentLayout/ContentLayoutThree";

const DetailPageBody = () =>{
    return(
        <Fragment>
            <Container>
                <div className="content_detail_body">
                   <Row>
                      <Col lg={9}>
                          <div className="content_detail">
                              <div className="content_title">
                                  তীব্র তাপে জ্বলছে নিজেই হাওয়া
                              </div>
                              <div className="content_bio">
                                 <div className="author_name">
                                    <FontAwesomeIcon icon={faUser}/> উম্মে রায়হানা
                                 </div>
                                 <div className="content_date">
                                    <FontAwesomeIcon icon={faClock}/> 18 October 2022
                                 </div>
                              </div>
                              <div className="content_image">
                                  <img src={demo1} alt="" />
                              </div>
                              <div className="content_text">

                                 <p>হাওয়া নামের একটা সিনেমা বের হইছে এই বছর। সিনেমার পরিচালক মেসবাউর রহমান সুমন। বাংলা সিনেমার ইতিহাসের এখনও পর্যন্ত সেরা সিনেমাগুলির একটা হইতেছে হাওয়া। হাওয়া নিয়া লেখার জন্য অনেকদিন ধইরাই হাত চুলকাইতে থাকলেও লেখা হইতেছিলো না। ছবিটা আবারও আরাম কইরা দেইখা নিয়া লিখবো - এই মনে কইরাও লিখতেছিলাম না। জেলা শহরের খারাপ পরিবেশের হলে দেখার কারণে বার বার মনযোগ কেটে গেছে। সিনেমা দেখার সময় ডিস্টার্ব মানে যে ভয়াবহ মানসিক নিপীড়ন এইটা জাইনাশুইনাই কি এরা এরকম করে! </p>

                                 <p>সে যা-ই হোক। তারপর মনে হইলো, সাত মণ ঘি-ও পুড়বে না, রাধাও নাচবে না। আবার কবে দেখা হবে! তার চেয়ে লিখেই ফেলি। সিনেমা নিয়া না লিখলেও সিনেমার গানটা এবং সিনেমা নিয়া আলোড়নটা সম্পর্কে তো লেখাই যায়।</p>

                                 <p>সিনেমা দেখার সময় খারাপ অডিয়েন্স থাকলেও একটা মজা হইছিলো। সাদা সাদা কালা কালা গানটা যখন শুরু হয়, পুরা হল গলা মিলায়া গাইতে থাকে। গানটা আগেই রিলিজ এবং হিট। গান হিট করলেই সিনেমাও ব্যবসাসফল হবে এমন কোন কথা নাই। কিন্তু হাওয়া সবদিকেই সফল ছবি।</p>

                                 <p>সঙ্গে আত্মিক যোগাযোগ বোধ করে, পূর্ব পরিচয়ের প্রয়োজন হয় না। তারা সবাই কাছাকাছি আসে, এটা সেটা বাজাইয়া তাল তোলে, মদ খায়, বিড়ি খায়, নাচে গায়।</p>

                                 <p>মানুষের ইতিহাসে শিকার কবে থাইকা পুরুষের একচ্ছত্র হইয়া গেছে এটা কে বলবে? কিন্তু মাছ ধরা নৌকায় নারীর কোন স্থান নাই। ছোটবেলায় একটা গল্পে পড়ছিলাম, হাতি শিকার করতে যাওয়ার আগে নান রকম নিয়ম কানুন পালন করতে হয়, এর মধ্যে একটা হইলো, নারীসঙ্গ করা যাবে না। কিন্তু দেখা যায় বড় নৌকাটায় একটা মেয়ে আছে, সে জানালা দিয়া নৃত্যরত পুরুষদের দেখতেছে, তার মুখে মৃদু হাসি। সে মজা পাইতেছে।</p>

                                 <p>একসঙ্গে এত পুরুষকে একসঙ্গে নাচগান করতে দেখলে যে কোন নারী মজা পাবে। সিনেমার পর্দায় দেইখাও আমি মজা পাইছি। বাস্তবে হইলে তো কথাই নাই। শাকরাইনে পুরান ঢাকায় গেলে পুরুষদের উদ্দাম নাচ দেখতে পাওয়া যায়, ঢাকাইয়া পোলারা দারুণ নাচে।</p>
                                 <p>সিনেমা দেখার সময় খারাপ অডিয়েন্স থাকলেও একটা মজা হইছিলো। সাদা সাদা কালা কালা গানটা যখন শুরু হয়, পুরা হল গলা মিলায়া গাইতে থাকে। গানটা আগেই রিলিজ এবং হিট। গান হিট করলেই সিনেমাও ব্যবসাসফল হবে এমন কোন কথা নাই। কিন্তু হাওয়া সবদিকেই সফল ছবি।</p>

                                 <p>সঙ্গে আত্মিক যোগাযোগ বোধ করে, পূর্ব পরিচয়ের প্রয়োজন হয় না। তারা সবাই কাছাকাছি আসে, এটা সেটা বাজাইয়া তাল তোলে, মদ খায়, বিড়ি খায়, নাচে গায়।</p>

                                 <p>মানুষের ইতিহাসে শিকার কবে থাইকা পুরুষের একচ্ছত্র হইয়া গেছে এটা কে বলবে? কিন্তু মাছ ধরা নৌকায় নারীর কোন স্থান নাই। ছোটবেলায় একটা গল্পে পড়ছিলাম, হাতি শিকার করতে যাওয়ার আগে নান রকম নিয়ম কানুন পালন করতে হয়, এর মধ্যে একটা হইলো, নারীসঙ্গ করা যাবে না। কিন্তু দেখা যায় বড় নৌকাটায় একটা মেয়ে আছে, সে জানালা দিয়া নৃত্যরত পুরুষদের দেখতেছে, তার মুখে মৃদু হাসি। সে মজা পাইতেছে।</p>
                                 
                                 <p>একসঙ্গে এত পুরুষকে একসঙ্গে নাচগান করতে দেখলে যে কোন নারী মজা পাবে। সিনেমার পর্দায় দেইখাও আমি মজা পাইছি। বাস্তবে হইলে তো কথাই নাই। শাকরাইনে পুরান ঢাকায় গেলে পুরুষদের উদ্দাম নাচ দেখতে পাওয়া যায়, ঢাকাইয়া পোলারা দারুণ নাচে।</p>
                                 <p>সিনেমা দেখার সময় খারাপ অডিয়েন্স থাকলেও একটা মজা হইছিলো। সাদা সাদা কালা কালা গানটা যখন শুরু হয়, পুরা হল গলা মিলায়া গাইতে থাকে। গানটা আগেই রিলিজ এবং হিট। গান হিট করলেই সিনেমাও ব্যবসাসফল হবে এমন কোন কথা নাই। কিন্তু হাওয়া সবদিকেই সফল ছবি।</p>

                                 <p>সঙ্গে আত্মিক যোগাযোগ বোধ করে, পূর্ব পরিচয়ের প্রয়োজন হয় না। তারা সবাই কাছাকাছি আসে, এটা সেটা বাজাইয়া তাল তোলে, মদ খায়, বিড়ি খায়, নাচে গায়।</p>

                                 <p>মানুষের ইতিহাসে শিকার কবে থাইকা পুরুষের একচ্ছত্র হইয়া গেছে এটা কে বলবে? কিন্তু মাছ ধরা নৌকায় নারীর কোন স্থান নাই। ছোটবেলায় একটা গল্পে পড়ছিলাম, হাতি শিকার করতে যাওয়ার আগে নান রকম নিয়ম কানুন পালন করতে হয়, এর মধ্যে একটা হইলো, নারীসঙ্গ করা যাবে না। কিন্তু দেখা যায় বড় নৌকাটায় একটা মেয়ে আছে, সে জানালা দিয়া নৃত্যরত পুরুষদের দেখতেছে, তার মুখে মৃদু হাসি। সে মজা পাইতেছে।</p>
                                 
                                 <p>একসঙ্গে এত পুরুষকে একসঙ্গে নাচগান করতে দেখলে যে কোন নারী মজা পাবে। সিনেমার পর্দায় দেইখাও আমি মজা পাইছি। বাস্তবে হইলে তো কথাই নাই। শাকরাইনে পুরান ঢাকায় গেলে পুরুষদের উদ্দাম নাচ দেখতে পাওয়া যায়, ঢাকাইয়া পোলারা দারুণ নাচে।</p>
                              </div>
                              <div className="author">
                                   <div className="author_img">
                                        <img src={demo1} alt="" />
                                   </div> 
                                   <div className="author_detail">
                                     <div className="authorName"> উম্মে রায়হানা </div>
                                     <div className="author_text">
                                     জন্ম- ১৯৮৪ ময়মনসিংহ শহরে। পড়াশোনা ঢাকা বিশ্ববিদ্যালয়। উইমেন অ্যান্ড জেন্ডার স্টাডিজ এ স্নাতকোত্তর এবং জার্নালিজম, মিডিয়া অ্যান্ড কমিউনিকেশন নিয়ে পরবর্তী মাস্টার্স। আগ্রহের জায়গা - মিডিয়া, ফেমিনিজমস, ফিল্ম, কবিতা, সমাজ আর সময়। পেশা- সাংবাদিকতা এবং গবেষণা। এক সন্তানের জননী, বিবাহ        বিচ্ছিন্ন একলা মানুষ।
                                     </div>
                                  </div>
                              </div>   
                              <div className="author_more_content">
                                 <h4> লেখকের আরো লেখা </h4>
                                <ul>
                                    <li> <Link to="/"> <FontAwesomeIcon icon={faChevronRight}/> মজনু শাহ’র দুটি কবিতা </Link></li>
                                    <li> <Link to="/"> <FontAwesomeIcon icon={faChevronRight}/>  নীতুর লিপস্টিক </Link> </li>
                                 </ul>
                              </div>
                          </div> 
                      </Col>
                      <Col lg={3}>
                        <ContentLayoutThree/>
                        <ContentLayoutThree/>
                        <ContentLayoutThree/>
                        <ContentLayoutThree/>
                        <ContentLayoutThree/>
                        <ContentLayoutThree/>
                        <ContentLayoutThree/>
                      </Col>
                   </Row>
                </div>
            </Container>
        </Fragment>
    )
} 
export default  DetailPageBody;